experiments/low_latency_pipeline/p0/logs/prod-81107-1.log
2025-08-09 12:40:16.606 | main | INFO | io.prometheus.jmx.JavaAgent | Starting ...
2025-08-09 12:40:16.990 | main | INFO | io.prometheus.jmx.JavaAgent | HTTP enabled [true]
2025-08-09 12:40:16.991 | main | INFO | io.prometheus.jmx.JavaAgent | HTTP host:port [0.0.0.0:7001]
2025-08-09 12:40:16.991 | main | INFO | io.prometheus.jmx.JavaAgent | Starting HTTPServer ...
2025-08-09 12:40:17.048 | main | INFO | io.prometheus.jmx.JavaAgent | HTTPServer started
2025-08-09 12:40:17.048 | main | INFO | io.prometheus.jmx.JavaAgent | OpenTelemetry enabled [false]
2025-08-09 12:40:17.049 | main | INFO | io.prometheus.jmx.JavaAgent | Running ...
49992 records sent, 9994.4 records/sec (4.77 MB/sec), 18.3 ms avg latency, 498.0 ms max latency, 2 ms 50th, 137 ms 95th, 176 ms 99th, 183 ms 99.9th.
50260 records sent, 10050.0 records/sec (4.79 MB/sec), 1.3 ms avg latency, 32.0 ms max latency, 1 ms 50th, 2 ms 95th, 3 ms 99th, 29 ms 99.9th.
50120 records sent, 10024.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 18.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 14 ms 99.9th.
50079 records sent, 10013.8 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 0.8 ms avg latency, 15.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50061 records sent, 10012.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10006.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 2 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50070 records sent, 10014.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 17.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50076 records sent, 10015.2 records/sec (4.78 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50035 records sent, 10005.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50080 records sent, 10014.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50049 records sent, 10007.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 3 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 0.8 ms avg latency, 11.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50049 records sent, 10007.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50066 records sent, 10013.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50044 records sent, 10008.8 records/sec (4.77 MB/sec), 0.8 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50039 records sent, 10007.8 records/sec (4.77 MB/sec), 0.8 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50061 records sent, 10012.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10013.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50051 records sent, 10010.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50047 records sent, 10009.4 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50053 records sent, 10010.6 records/sec (4.77 MB/sec), 0.8 ms avg latency, 13.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 36.0 ms max latency, 1 ms 50th, 1 ms 95th, 4 ms 99th, 33 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50063 records sent, 10012.6 records/sec (4.77 MB/sec), 0.8 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50038 records sent, 10005.6 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50058 records sent, 10009.6 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50032 records sent, 10006.4 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50079 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 11.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50041 records sent, 10006.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 6.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 3 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.8 ms avg latency, 91.0 ms max latency, 1 ms 50th, 1 ms 95th, 48 ms 99th, 89 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 12.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 3 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 14.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50048 records sent, 10009.6 records/sec (4.77 MB/sec), 2.2 ms avg latency, 107.0 ms max latency, 1 ms 50th, 1 ms 95th, 61 ms 99th, 103 ms 99.9th.
50062 records sent, 10010.4 records/sec (4.77 MB/sec), 0.9 ms avg latency, 12.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10006.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 13.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10006.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 6.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 2 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50054 records sent, 10006.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50056 records sent, 10011.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10014.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10014.0 records/sec (4.78 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10006.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50080 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50075 records sent, 10015.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50026 records sent, 10005.2 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 1 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 1 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.8 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 0.8 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50045 records sent, 10009.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50076 records sent, 10013.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50039 records sent, 10005.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50069 records sent, 10013.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50064 records sent, 10012.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50046 records sent, 10009.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.9 ms avg latency, 87.0 ms max latency, 1 ms 50th, 2 ms 95th, 42 ms 99th, 83 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50071 records sent, 10010.2 records/sec (4.77 MB/sec), 3.1 ms avg latency, 135.0 ms max latency, 1 ms 50th, 2 ms 95th, 90 ms 99th, 131 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 11.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50051 records sent, 10008.2 records/sec (4.77 MB/sec), 1.2 ms avg latency, 37.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 34 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50062 records sent, 10012.4 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50038 records sent, 10005.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50071 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 19.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 2.5 ms avg latency, 117.0 ms max latency, 1 ms 50th, 2 ms 95th, 71 ms 99th, 113 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50061 records sent, 10012.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 14.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 11 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50031 records sent, 10006.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 18.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50031 records sent, 10006.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 5.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 2 ms 99.9th.
50050 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.